# Projeto de Bases de Dados - Parte 3

### Docente Responsável

Prof. FirstName LastName

### Grupo GG
<dl>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
<dl>

In [1]:
%load_ext sql
%sql postgresql://db:db@postgres/db

# Empresa de comércio online

## 0. Carregamento da Base de Dados

Carregue o esquema de Base de Dados apresentado no Anexo A.

In [3]:
%%sql

DROP TABLE IF EXISTS customer CASCADE;
DROP TABLE IF EXISTS orders CASCADE;
DROP TABLE IF EXISTS pay CASCADE;
DROP TABLE IF EXISTS employee CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS department CASCADE;
DROP TABLE IF EXISTS workplace CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS office CASCADE;
DROP TABLE IF EXISTS warehouse CASCADE;
DROP TABLE IF EXISTS product CASCADE;
DROP TABLE IF EXISTS contains CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;

CREATE TABLE customer(
cust_no INTEGER PRIMARY KEY,
name VARCHAR(80) NOT NULL,
email VARCHAR(254) UNIQUE NOT NULL,
phone VARCHAR(15),
address VARCHAR(255)
);

CREATE TABLE orders(
order_no INTEGER PRIMARY KEY,
cust_no INTEGER NOT NULL REFERENCES customer,
date DATE NOT NULL
--order_no must exist in contains
);

CREATE TABLE pay(
order_no INTEGER PRIMARY KEY REFERENCES orders,
cust_no INTEGER NOT NULL REFERENCES customer
);

CREATE TABLE employee(
ssn VARCHAR(20) PRIMARY KEY,
TIN VARCHAR(20) UNIQUE NOT NULL,
bdate DATE,
name VARCHAR NOT NULL
--age must be >=18
);

CREATE TABLE process(
ssn VARCHAR(20) REFERENCES employee,
order_no INTEGER REFERENCES orders,
PRIMARY KEY (ssn, order_no)
);

CREATE TABLE department(
name VARCHAR PRIMARY KEY
);

CREATE TABLE workplace(
address VARCHAR PRIMARY KEY,
lat NUMERIC(8, 6) NOT NULL,
long NUMERIC(9, 6) NOT NULL,
UNIQUE(lat, long)
--address must be in warehouse or office but not both
);

CREATE TABLE office(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);

CREATE TABLE warehouse(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);

CREATE TABLE works(
ssn VARCHAR(20) REFERENCES employee,
name VARCHAR(200) REFERENCES department,
address VARCHAR(255) REFERENCES workplace,
PRIMARY KEY (ssn, name, address)
);

CREATE TABLE product(
SKU VARCHAR(25) PRIMARY KEY,
name VARCHAR(200) NOT NULL,
description VARCHAR,
price NUMERIC(10, 2) NOT NULL,
ean NUMERIC(13) UNIQUE
);

CREATE TABLE contains(
order_no INTEGER REFERENCES orders,
SKU VARCHAR(25) REFERENCES product,
qty INTEGER,
PRIMARY KEY (order_no, SKU)
);

CREATE TABLE supplier(
TIN VARCHAR(20) PRIMARY KEY,
name VARCHAR(200),
address VARCHAR(255),
SKU VARCHAR(25) REFERENCES product,
date DATE
);

CREATE TABLE delivery(
address VARCHAR(255) REFERENCES warehouse,
TIN VARCHAR(20) REFERENCES supplier,
PRIMARY KEY (address, TIN)
);

Running query in 'postgresql://db:***@postgres/db'

Crie as instruções para o seu preenchimento de forma consistente, garantindo que todas as consultas SQL e OLAP, apresentadas mais adiante, produzam um resultado não vazio.

In [4]:
%%sql
/* inserting into the costumers table*/
INSERT INTO customer (cust_no, name, email, phone, address)
VALUES
	(1, 'Zeus', 'zeus@example.com', '1234567890', 'Rua Monte Olimpo, 1, 1234-456 Porto'),
	(2, 'Hera', 'hera@example.com', '9876543210', 'Rua Olimpo, 10, 5432-123 Lisboa'),
	(3, 'Poseidon', 'poseidon@example.com', '5551234567', 'Avenida Tridente, 456, 7890-123 Atlântida'),
	(4, 'Athena', 'athena@example.com', '9998887777', 'Rua Sabedoria, 789, 4567-890 Atenas'),
	(5, 'Apollo', 'apollo@example.com', '4445556666', 'Avenida Raios Solares, 246, 1357-246 Delfos'),
	(6, 'Artemis', 'artemis@example.com', '2223334444', 'Rua do Luar, 357, 2468-135 Arcádia'),
	(7, 'Hermes', 'hermes@example.com', '7776665555', 'Estrada dos Mensageiros, 888, 7890-123 Olimpo'),
	(8, 'Aphrodite', 'aphrodite@example.com', '1112223333', 'Rua do Amor, 555, 6789-012 Chipre'),
	(9, 'Dionysus', 'dionysus@example.com', '9999999999', 'Rua do Vinho, 999, 2468-135 Dionísia'),
	(10, 'Hades', 'hades@example.com', '8888888888', 'Avenida Submundo, 666, 0123-456 Tartaros'),
	(11, 'Demeter', 'demeter@example.com', '7777777777', 'Rua Colheita, 444, 7890-123 Elêusis'),
	(12, 'Hephaestus', 'hephaestus@example.com', '5555555555', 'Rua da Forja, 222, 1357-246 Monte Etna'),
	(13, 'Persephone', 'persephone@example.com', '3333333333', 'Rua Primavera, 333, 2468-135 Sicília'),
	(14, 'Hecate', 'hecate@example.com', '4444444444', 'Avenida Bruxas, 777, 6789-012 Hecate'),
	(15, 'Hestia', 'hestia@example.com', '6666666666', 'Rua Lareira, 111, 0123-456 Olimpo'),
	(16, 'Ares', 'ares@example.com', '2222222222', 'Rua Guerra, 777, 7890-123 Trácia'),
	(17, 'Hermaphroditus', 'hermaphroditus@example.com', '4445556666', 'Estrada Dual, 555, 2468-135 Ida'),
	(18, 'Nike', 'nike@example.com', '1111111111', 'Rua Vitória, 888, 1357-246 Olímpia'),
    (19, 'Pan', 'pan@example.com', '3334445555', 'Grove Avenue, 444, 2468-135 Arcadia'),
	(20, 'Achilles', 'achilles@example.com', '9999999999', 'Myrmidon Lane, 333, 6789-012 Phthia');

/*inserting into the orders table*/
INSERT INTO orders (order_no, cust_no, date)
VALUES
	(1, 1, '2022-12-15'),
	(2, 2, '2022-11-20'),
	(3, 3, '2023-01-03'),
	(4, 4, '2022-02-08'),
	(5, 5, '2023-03-12'),
	(6, 6, '2023-04-17'),
	(7, 7, '2023-05-21'),
	(8, 8, '2023-06-25'),
	(9, 9, '2022-07-29'),
	(10, 10, '2023-08-02'),
	(11, 11, '2023-09-06'),
	(12, 12, '2020-10-11'),
	(13, 13, '2023-11-15'),
	(14, 14, '2023-12-20'),
	(15, 15, '2024-01-24'),
	(16, 16, '2024-02-28'),
	(17, 17, '2024-03-04'),
	(18, 18, '2024-04-08'),
	(19, 19, '2024-05-12'),
	(20, 20, '2024-06-16');

/*pay table*/
INSERT INTO pay (order_no, cust_no)
VALUES
	(1, 1),	(2, 2),(3, 3),(4, 4),(5, 5),(6, 6),(7, 7),(8, 8),(9, 9),(10, 10),
	(11, 11),(12, 12),(13, 13),(14, 14),(15, 15),(16, 16),(17, 17),(18, 18),
	(19, 19),(20, 20);

/*emplpyee table*/

INSERT INTO employee (ssn, TIN, bdate, name)
VALUES
	('12341235', '7456788', '1990-01-01', 'Apollo'),
	('5673457', '3547465', '1995-02-02', 'Artemis'),
	('9876543', '4567890', '1988-03-03', 'Zeus'),
	('4567890', '1234568', '1992-04-04', 'Hera'),
	('3456789', '6789012', '1994-05-05', 'Poseidon'),
	('2345678', '9012345', '1991-06-06', 'Athena'),
	('6789012', '2345678', '1993-07-07', 'Hermes'),
	('7890123', '5678901', '1997-08-08', 'Aphrodite'),
	('8901234', '8901234', '1989-09-09', 'Dionysus'),
	('9012345', '1234567', '1996-10-10', 'Hades');

/*check the age check
INSERT INTO employee (ssn, TIN, bdate, name)
VALUES
	('123', '123', '2020-01-01', 'someone');
*/
/*process table*/
	INSERT INTO process (ssn, order_no)
VALUES
	('12341235', 1),('5673457', 2),('9876543', 3),('4567890', 4),('3456789', 5),
	('2345678', 6),('6789012', 7),('7890123', 8),('8901234', 9),('9012345', 10);

/*departemnet*/
INSERT INTO department (name)
VALUES
('Development'),
('Sales'),
('Marketing'),
('Human Resources'),
('Finance'),
('Operations'),
('Customer Service'),
('Research and Development'),
('IT'),
('Legal');

/*workplace*/
INSERT INTO workplace (address, lat, long)
VALUES
('123 Main Street', 37.983809, 23.727538),
('456 Elm Street', 38.011663, 23.732757),
('789 Oak Avenue', 37.975925, 23.741796),
('321 Pine Road', 37.990515, 23.719884),
('987 Maple Lane', 38.002743, 23.726312),
('654 Cedar Boulevard', 37.985681, 23.730201),
('321 Walnut Drive', 38.006287, 23.733652),
('654 Birch Court', 37.972155, 23.719127),
('987 Cherry Avenue', 37.996925, 23.735604),
('321 Poplar Street', 37.979373, 23.726941);

/*office*/
INSERT INTO office (address)
VALUES
('123 Main Street'),('456 Elm Street'),('789 Oak Avenue'),('321 Pine Road'),
('987 Maple Lane'),('654 Cedar Boulevard'),('321 Walnut Drive'),('654 Birch Court'),
('987 Cherry Avenue'),('321 Poplar Street');

INSERT INTO warehouse (address)
VALUES
('456 Elm Street'),('789 Oak Avenue'),('321 Pine Road'),('987 Maple Lane'),
('654 Cedar Boulevard'),('321 Walnut Drive'),('654 Birch Court'),
('987 Cherry Avenue'),('321 Poplar Street'),('123 Main Street');

/*works*/
INSERT INTO works (ssn, name, address)
VALUES
('12341235', 'Development', '123 Main Street'),
('5673457', 'Sales', '456 Elm Street'),
('9876543', 'Development', '789 Oak Avenue'),
('4567890', 'Sales', '321 Pine Road'),
('3456789', 'Marketing', '987 Maple Lane'),
('2345678', 'Human Resources', '654 Cedar Boulevard'),
('6789012', 'Finance', '321 Walnut Drive'),
('7890123', 'Operations', '654 Birch Court'),
('8901234', 'Customer Service', '987 Cherry Avenue'),
('9012345', 'Research and Development', '321 Poplar Street');

/*product*/
INSERT INTO product (SKU, name, description, price, ean)
VALUES
('P1', 'Thunderbolt', 'Powerful weapon', 90.50, 1234567890123),
('P2', 'Moonbow', 'Ethereal bow', 140.00, 9876543210987),
('P3', 'Starfire', 'Celestial staff', 120.00, 6543210987654),
('P4', 'Frostbite', 'Frozen dagger', 60.00, 7890123456789),
('P5', 'Phoenix Feather', 'Mystical artifact', 200.00, 3456789012345),
('P6', 'Shadowstrike', 'Stealthy assassin blade', 75.00, 9012345678901),
('P7', 'Soulbound', 'Enchanted amulet', 180.00, 2345678901234),
('P8', 'Dragonheart', 'Legendary armor', 250.00, 5678901234567),
('P9', 'Silverlight', 'Divine sword', 150.00, 8901234567890),
('P10', 'Eclipse', 'Dark energy orb', 110.00, 4321098765432);

/*contains*/
INSERT INTO contains (order_no, SKU, qty)
VALUES
(1, 'P1', 2),(2, 'P2', 1),(3, 'P3', 3),(4, 'P4', 1),(5, 'P5', 2),(6, 'P6', 1),
(7, 'P7', 2),(8, 'P8', 1),(9, 'P9', 3),(10, 'P10', 2),(11, 'P1', 1),(12, 'P2', 2),
(13, 'P3', 2),(14, 'P4', 1),(15, 'P5', 3),(16, 'P6', 2),(17, 'P7', 1),(18, 'P8', 2),
(19, 'P9', 1),(20, 'P10', 3);

/*suplier*/
INSERT INTO supplier (TIN, name, address, SKU, date)
VALUES
('S1', 'Athena Supplies', 'Mount Olympus, 12345 Greece', 'P1', '2023-06-02'),
('S2', 'Hermes Delivery', 'Olympus Street, 54321 Greece', 'P2', '2023-06-06'),
('S3', 'Zeus Imports', 'Olympus Plaza, 56789 Greece', 'P3', '2023-06-10'),
('S4', 'Poseidon Trading', 'Neptune Avenue, 98765 Greece', 'P4', '2023-06-14'),
('S5', 'Apollo Exports', 'Sunlight Lane, 45678 Greece', 'P5', '2023-06-18'),
('S6', 'Artemis Logistics', 'Moonlight Road, 34567 Greece', 'P6', '2023-06-22'),
('S7', 'Hades Distribution', 'Underworld Street, 23456 Greece', 'P7', '2023-06-26'),
('S8', 'Demeter Imports', 'Harvest Lane, 87654 Greece', 'P8', '2023-06-30'),
('S9', 'Hephaestus Manufacturing', 'Forge Avenue, 76543 Greece', 'P9', '2023-07-04'),
('S10', 'Hera Trading', 'Mount Olympus, 12345 Greece', 'P10', '2023-07-08');

/*delivery*/
INSERT INTO delivery (address, TIN)
VALUES
('456 Elm Street', 'S2'),('789 Oak Avenue', 'S3'),('321 Pine Road', 'S4'),
('987 Maple Lane', 'S5'),('654 Cedar Boulevard', 'S6'),('321 Walnut Drive', 'S7'),
('654 Birch Court', 'S8'),('987 Cherry Avenue', 'S9'),('321 Poplar Street', 'S10'),
('123 Main Street', 'S1');

Running query in 'postgresql://db:***@postgres/db'

20 rows affected.

20 rows affected.

20 rows affected.

10 rows affected.

10 rows affected.

10 rows affected.

10 rows affected.

10 rows affected.

10 rows affected.

10 rows affected.

10 rows affected.

20 rows affected.

10 rows affected.

10 rows affected.

## 1. Restrições de Integridade

Apresente o código para implementar as seguintes restrições de integridade, se necessário, com recurso a extensões procedimentais SQL (Stored Procedures e Triggers):

(RI-1) Nenhum empregado pode ter menos de 18 anos de idade

In [ ]:
%%sql
-- (RI-1)

(RI-2) Um 'Workplace' é obrigatoriamente um 'Office' ou 'Warehouse' mas não pode ser ambos

In [ ]:
%%sql
-- (RI-2)

(RI-3) Uma 'Order' tem de figurar obrigatoriamente em 'Contains'.

In [ ]:
%%sql
-- (RI-3)

## 2. Consultas SQL

Apresente a consulta SQL mais sucinta para cada uma das seguintes questões

1) Qual o número e nome do(s) cliente(s) com maior valor total de encomendas pagas?

In [19]:
%%sql
SELECT c.cust_no, c.name
FROM customer c
JOIN pay p ON c.cust_no = p.cust_no
JOIN orders o ON p.order_no = o.order_no
JOIN contains ct ON o.order_no = ct.order_no
JOIN product pr ON ct.SKU = pr.SKU
GROUP BY c.cust_no, c.name
ORDER BY SUM(ct.qty * pr.price) DESC
LIMIT 1;

Running query in 'postgresql://db:***@postgres/db'

1 rows affected.

+---------+--------+
| cust_no |  name  |
+---------+--------+
|    15   | Hestia |
+---------+--------+

2. Qual o nome dos empregados que processaram encomendas em todos os dias de 2022 em que houve encomendas?

In [20]:
%%sql
SELECT e.name
FROM employee e
WHERE NOT EXISTS (
  SELECT DISTINCT date
  FROM orders o
  WHERE date_part('year', o.date) = 2022
    AND NOT EXISTS (
      SELECT 1
      FROM process p
      WHERE p.ssn = e.ssn AND p.order_no = o.order_no
    )
);

Running query in 'postgresql://db:***@postgres/db'

+------+
| name |
+------+
+------+

3. Quantas encomendas foram realizadas mas não pagas em cada mês de 2022?

In [21]:
%%sql
SELECT date_trunc('month', o.date) AS month, COUNT(*) AS unpaid_orders
FROM orders o
WHERE o.date >= '2022-01-01' AND o.date < '2023-01-01'
  AND NOT EXISTS (
    SELECT 1
    FROM pay p
    WHERE p.order_no = o.order_no
  )
GROUP BY month
ORDER BY month;

Running query in 'postgresql://db:***@postgres/db'

+-------+---------------+
| month | unpaid_orders |
+-------+---------------+
+-------+---------------+

## 3. Vistas

Crie uma vista que resuma as informações mais importantes sobre as vendas de produtos, combinando informações de diferentes tabelas do esquema de base de dados. A vista deve ter o seguinte esquema:

product_sales(sku, order_no, qty, total_price, year, month, day_of_month, day_of_week, city)

In [22]:
%%sql
DROP VIEW IF EXISTS product_sales;
CREATE VIEW product_sales AS
SELECT ct.sku AS sku,
       o.order_no as order_no,
       ct.qty AS qty,
       p.price * ct.qty AS total_price,
       EXTRACT(YEAR FROM o.date) AS year,
       EXTRACT(MONTH FROM o.date) AS month,
       EXTRACT(DAY FROM o.date) AS day_of_month,
       EXTRACT(DOW FROM o.date) AS day_of_week,
       SPLIT_PART(address, ' ', ARRAY_LENGTH(string_to_array(address, ' '), 1)) AS city
FROM contains ct
JOIN orders o ON ct.order_no = o.order_no
JOIN pay py ON o.order_no = py.order_no AND o.cust_no = py.cust_no
JOIN product p ON ct.sku = p.sku
JOIN customer c ON o.cust_no = c.cust_no;

Running query in 'postgresql://db:***@postgres/db'

## 4. Desenvolvimento de Aplicação

### Explicação da arquitetura da aplicação web, incluindo um link para uma versão de trabalho e as relações entre os vários ficheiros na pasta web/arquivos

...

## 5. Consultas OLAP

Usando a vista desenvolvida para a Questão 3, escreva duas consultas SQL que permitam analisar:

1. As quantidade e valores totais de venda de cada produto em 2022, globalmente, por cidade, por mês, dia do mês e dia da semana

In [23]:
%%sql

SELECT
  p.name AS product_name,
  SUM(ps.qty) AS total_quantity,
  SUM(ps.total_price) AS total_sales,
  ps.city AS city,
  ps.year AS sales_year,
  ps.month  AS month,
  ps.day_of_month AS day_of_month,
  ps.day_of_week  AS day_of_week
FROM
  product_sales ps
JOIN
  product p ON ps.sku = p.sku
WHERE
  ps.year = 2022
GROUP BY
   ROLLUP (product_name, sales_year, city, month, day_of_month, day_of_week)
ORDER BY
  sales_year, city, month, day_of_month, day_of_week, product_name;

Running query in 'postgresql://db:***@postgres/db'

25 rows affected.

+--------------+----------------+-------------+----------+------------+-------+--------------+-------------+
| product_name | total_quantity | total_sales |   city   | sales_year | month | day_of_month | day_of_week |
+--------------+----------------+-------------+----------+------------+-------+--------------+-------------+
|  Frostbite   |       1        |    60.00    |  Atenas  |    2022    |   2   |      8       |      2      |
|  Frostbite   |       1        |    60.00    |  Atenas  |    2022    |   2   |      8       |     None    |
|  Frostbite   |       1        |    60.00    |  Atenas  |    2022    |   2   |     None     |     None    |
|  Frostbite   |       1        |    60.00    |  Atenas  |    2022    |  None |     None     |     None    |
| Silverlight  |       3        |    450.00   | Dionísia |    2022    |   7   |      29      |      5      |
| Silverlight  |       3        |    450.00   | Dionísia |    2022    |   7   |      29      |     None    |
| Silverlight  |       3        |    450.00   | Dionísia |    2022    |   7   |     None     |     None    |
| Silverlight  |       3        |    450.00   | Dionísia |    2022    |  None |     None     |     None    |
|   Moonbow    |       1        |    140.00   |  Lisboa  |    2022    |   11  |      20      |      0      |
|   Moonbow    |       1        |    140.00   |  Lisboa  |    2022    |   11  |      20      |     None    |
+--------------+----------------+-------------+----------+------------+-------+--------------+-------------+

2. O valor médio diário das vendas de todos os produtos em 2022, globalmente, por mês e dia da semana

In [24]:
%%sql

SELECT
    ps.month,
    ps.day_of_week,
    ROUND(AVG(ps.total_price), 2) AS average_daily_sales
FROM
    product_sales ps
WHERE
    ps.year = 2022
GROUP BY
    GROUPING SETS (
        (),
        (ps.month),
        (ps.day_of_week),
        (ps.month, ps.day_of_week)
    )
ORDER BY
    ps.month,
    ps.day_of_week;

Running query in 'postgresql://db:***@postgres/db'

13 rows affected.

+-------+-------------+---------------------+
| month | day_of_week | average_daily_sales |
+-------+-------------+---------------------+
|   2   |      2      |        60.00        |
|   2   |     None    |        60.00        |
|   7   |      5      |        450.00       |
|   7   |     None    |        450.00       |
|   11  |      0      |        140.00       |
|   11  |     None    |        140.00       |
|   12  |      4      |        181.00       |
|   12  |     None    |        181.00       |
|  None |      0      |        140.00       |
|  None |      2      |        60.00        |
+-------+-------------+---------------------+

## 6. Índices

Indique, com a devida justificação, que tipo de índice(s), sobre qual(is) atributo(s) e sobre qual(is) tabela(s) faria sentido criar, de forma a agilizar a execução de cada uma das seguintes consultas:

### 6.1
SELECT order_no
FROM orders 
JOIN contains USING (order_no) 
JOIN product USING (SKU) 
WHERE price > 50 AND 
EXTRACT(YEAR FROM date) = 2023

### Tipo de Índice, Atributos & Justificação

...

### 6.2
SELECT order_no, SUM(qty*price)
FROM contains 
JOIN product USING (SKU) 
WHERE name LIKE ‘A%’ 
GROUP BY order_no;

### Tipo de Índice, Atributos & Justificação

...